# Задача 2: Найдите сумму цифр трехзначного числа.
# *Пример:*
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

# number = int(input("Введите 3-х значное число: "))
# sumOfDigit = 0
# while number > 0:
#     sumOfDigit += number % 10
#     number = number // 10
# print(sumOfDigit)

# Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов.
# Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали одинаковое
# количество журавликов, а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?
# *Пример:*
# 6 -> 1  4  1
# 24 -> 4  16  4
# 60 -> 10  40  10

# sum = int(input("Сколько всего журавлей сделали детишки: "))

# sergAndPetya = int(sum / 6)
# katya = sergAndPetya * 4
# petya = sergAndPetya
# serg = sergAndPetya

# print(petya, katya, serg)

